package ru.romanoval.testKotlin.model

class Data {
    companion object {

        fun getGoodHabits() = ArrayList(listOf(
            Habit(
                "Привычка хорошая 1",
                "Описание",
                "Высокий",
                true,
                "Каждый день",
                "#757de8",
                12
            )
            ,
            Habit(
                "Привычка хорошая 2",
                "Описание2",
                "Высокий",
                true,
                "Каждый день",
                "#757de8",
                12
            ),
            Habit(
                "Привычка хорошая 3",
                "Описание3",
                "Высокий",
                true,
                "Каждый день",
                "#757de8",
                12
            ),
            Habit(
                "Привычка хорошая 4",
                "Описание 4",
                "Высокий",
                true,
                "Каждый день",
                "#757de8",
                12
            )
            ,
            Habit(
                "Привычка хорошая 5",
                "Описание 5",
                "Высокий",
                true,
                "Каждый день",
                "#757de8",
                12
            ),
            Habit(
                "Привычка хорошая 6",
                "Описание 6",
                "Высокий",
                true,
                "Каждый день",
                "#757de8",
                12
            )
        ).toMutableList())

        fun getBadHabits() = ArrayList(listOf(
            Habit(
                "Привычка плохая 1",
                "Описание",
                "Высокий",
                true,
                "Каждый день",
                "#757de8",
                12
            )
            ,
            Habit(
                "Привычка плохая 2",
                "Описание2",
                "Высокий",
                true,
                "Каждый день",
                "#757de8",
                12
            ),
            Habit(
                "Привычка плохая 3",
                "Описание3",
                "Высокий",
                true,
                "Каждый день",
                "#757de8",
                12
            ),
            Habit(
                "Привычка плохая 4",
                "Описание 4",
                "Высокий",
                true,
                "Каждый день",
                "#757de8",
                12
            )
            ,
            Habit(
                "Привычка плохая 5",
                "Описание 5",
                "Высокий",
                true,
                "Каждый день",
                "#757de8",
                12
            ),
            Habit(
                "Привычка плохая 6",
                "Описание 6",
                "Высокий",
                true,
                "Каждый день",
                "#757de8",
                12
            )
        ).toMutableList())
    }
}